# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetting..::..Name Property
PrintSetting Class See Also
---
Returns the Name of Print Setup.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { get; set; }
```

Visual Basic
---
```text
Public Overrides Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
```

# Remarks
Retrieve/set the name of Print Setup.
# See Also
PrintSetting Class
Autodesk.Revit.DB Namespace